{"license":"MIT","file_hash":null,"name":"Quasar","version":"0.1.0","description":"I appreciate your precious time and mine . That's why, i contribute this real time saver useful package.\r\n\r\nFor your reference please don't mind to check this blog:\r\n\r\nhttps://twentytwo.space/2018/04/01/quasar-revit-dynamo-package/\r\n\r\nand contact me @https://twentytwo.space/contact","group":"BIM Utilities","keywords":["revit","dynamo","package","quasar"],"dependencies":[],"contents":"CreatDuctsByModelCurves - Create ducts by model curves and family type., CreateBeamsByModelCurves - Create beams by model curves., CustomCheckboxSelection - Create checkboxes  with input list and select items., CustomDropdownSelection - Create a dropdown with checkboxes. First input is a list and Second input is a nested list.\r\n\r\nEg. {\"a\",\"b\",\"c\"} and {{1,2,3},{4,5,6},{7,8,9}}.\r\nIt match their index. So, {1,2,3} is under dropdown \"a\". , DynamoNodes.DiamondPanel - Surface divides to diamond panels and triangle panels by UV divisions., ElementSelector - Select element by category or parameter inputs ..., FamilyInstanceByTypeName - A type name or comma separated type names to collect family instances., FilterSelectAndDelete - Select filter elements and delete in one shot ..., GetLinkDocument - Get all link document. Each list contains ,\r\n\r\n      [0] Name of Link Document (String)\r\n      [1] Link Document (Document)\r\n, LinkReloadFromSelection - Link document reload from select check box., ReloadAllLinkDocument - Reload all link document from their saved path (directory)., SelectElementByParameter - Elements selection by given parameter name and value.\r\nNumeric Operator - \">\" , \"<\" , \">=\" , \"<=\" , \"=\"\r\nString Operator - \"begins with\" , \"contains\" , \"ends with\" , \"equals\", ViewPortAlignment - Views arrange and align on sheets based on template sheet view ports position and location., ViewSelector - Select views by check boxes , WallPaintRemove - Remove paint from input walls","engine_version":"1.3.2.2480","engine":"dynamo","engine_metadata":"","site_url":"https://twentytwo.space/2018/04/01/quasar-revit-dynamo-package/","repository_url":"https://github.com/mgjean/quasar","contains_binaries":true,"node_libraries":["Quasar, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null"]}