{"license":"MIT","file_hash":null,"name":"Quasar","version":"2.1.0","description":"A collection of revit utility nodes to enhance productivity.\r\n\r\n** Quasar View Extension includes in 2.x.xxx version.**\r\n\r\nFor usage or more info :\r\n\r\nhttps://twentytwo.space/2018/04/01/quasar\r\n\r\nand contact me @https://twentytwo.space/contact","group":"Revit Utilities","keywords":["revit","dynamo","quasar","package"],"dependencies":[],"contents":"AllElementsOfWorkset - Collect all elements from input workset., CopyLevelAndGridFromLinkDocument - Select link document to copy levels and grids., CreatDuctsByModelCurves - Create ducts by model curves and family type., CreateBeamsByModelCurves - Create beams by model curves., CustomCheckboxSelection - Create checkboxes  with input list and select items., CustomDropdownSelection - Create a dropdown with checkboxes. First input is a list and Second input is a nested list.\r\n\r\nEg. {\"a\",\"b\",\"c\"} and {{1,2,3},{4,5,6},{7,8,9}}.\r\nIt match their index. So, {1,2,3} is under dropdown \"a\". , DeleteByCategory - All elements under provided category will be removed., DeleteElement - Input a list elements or single element, delete from document., DiamondPanel - Surface divides to diamond panels and triangle panels by UV divisions., DuplicateSheetsWithViews - Duplicate given sheets list, containing all views by new  sheets names, numbers and a titleblock , ElementSelector - This UI node is to select element by category and additionally can filter out by parameter and its valule., FamilyInstanceByTypeName - A list of  type names to collect family instances., FilterSelectAndDelete - Select filter elements and delete in one shot ..., GetAllWorksets - Collect all user created worksets from current document., GetBuiltInCategory - Collect built-in category object and id by category, GetLinkDocument - Get all link document. Each list contains ,\r\n\r\n      [0] Name of Link Document (String)\r\n      [1] Link Document (Document)\r\n, GridNamingGenerator - Generate horizontal(X) or vertical(Y) grids naming  by providing startfrom(string) value and reverse (boolean) value., IsometricViewsBySectionViews - This node performs like a Revit's feature \" Orient To View \". It create isometric views based on provide sections or elevations views., LinkLevelGrid-AllViews - Hide, unhide link documents' levels and grids in all views (floorplan, ceilingplan, elevations, sections)., LinkReloadFromSelection - Link document reload from select check box., PolygonsByCurves - Create polygon by curve and number of side, returns value [ polygon, [line-segments] ], ReloadAllLinkDocument - Reload all link document from their saved path (directory)., RemoveLineStyles - Remove line styles from the current documet by keywords (string list)., RemoveProjectParameters - Remove a single or a list of  project parameter by a parameter name or a list of parameters names. , RoomCollector - Collect rooms by their status., RoomCollectorUI - Collect rooms by their status with checkbox. , RoomSolidGeometry - Collect dynamo geometry and revit geometry from room., RoomTagToRoom - Relocate room tag to associate room location, SetFillRegionLine - Modify fill region type line styles by given line style type in active view (default), set false to modify all view in the document. , TransferLegend - Select and copy legend views from a link document file., TransferViewTempateAndFilterUI - Select view templates to transfer from link document  to current document with or without applied filters., ViewPortAlignment - Views arrange and align on sheets based on template sheet view ports position and location., ViewSelector - Select views by check boxes , WallAndGridDimension - Create horizontal and vertical dimensions between walls and grids .\r\n**Only work for walls and grids**, WallPaintRemove - Remove paint from walls","engine_version":"2.0.1.5065","engine":"dynamo","engine_metadata":"","site_url":"https://twentytwo.space/2018/04/01/quasar","repository_url":"https://github.com/mgjean/quasar","contains_binaries":true,"node_libraries":["Quasar, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null"]}