{"license":"MIT","file_hash":null,"name":"Quasar","version":"0.0.3","description":"Of course we appreciate our time, that's why i contribute real time saver useful nodes.","group":"BIM Utilities","keywords":["revit","dynamo","package","quasar"],"dependencies":[],"contents":"3DViewsSectionBoxesByRooms - Create 3DViews with section boxes by room elements and offset., BackgroundColor - Change background color of the document.\r\nSet = True, Reset = False., CeilingViewsForRooms - Create ceiling plans for each of the rooms.\r\nThis node take only one ceiling plan which will be duplicated for given amount of rooms and crop by room bounding box and offset., CloseHiddenViews - Close hidden views of current document., CloudRender - Do cloud rendering jobs with custom settings., ElementFilterByLevel - Elements filter by given level., ElementsByParameterNameValue - Collect and highlight elements by parameter name and value. Operator  has two type : string and numeric.\r\nString operators : \"begins with\", \"contains\", \"ends with\", \"equals\".\r\nNumeric operators : \">\", \"=>\", \"<\", \"<=\", \"=\"., ElevationsInRooms - Create elevations views in rooms by given floor plan., FamilyAndRoomByLevel - This node return families instances inside each rooms by their associate level., FamilyInstanceByFamilyTypeName - This node take single family type name or comma separated family type names as a string. Name must be exactly the same with family type name. And it return list of family instances.\r\n, FilterElementByFillPatternCategory - Create filter element with override graphics by color, fill pattern, category and name., Floor.ByRoomNameTypeLevel - Create floor(s) by single name or comma separated room names in a given level., GetBuiltInParameterName - Get BuiltIn Parameter names by parameter names and element., GetElementsFromLinkDocs - Collect elements by category from a link document., GetLinkDocument - Get all link documents from current document.\r\n*Note : index zero is link document name and index one is link document.  , HideUnhideElementsInViews - Element(s) hide / unhide in given views.\r\nTrue hide elements, False unhide elements.\r\nDefault is True., LinkLevelGrid - Hide all levels and grids from link files., OverrideProjectionCutPattern - Select element and override fill pattern and color in current view., PlanViewCropByRoom - Crop floor or ceiling plan views by given room. Offset is a distance of crop box from room boundary and unit is millimeter. View scale is 1:50 by default. , ReloadLink - Reload revit links documents from saved path directory., RemoveUnplacedRoom - This node remove all unplaced room in the document., SpaceLimitBaseOffsetByRoom - Adjust space limit-offset and base-offset value  base on associate room values. Plus or minus offset are allowed. Default value is 0. Unit is millimeter. , SpaceNameNumberByRoom - Write spaces names and numbers value from their associate rooms., UIElementSelector - This node [a simple window form interface] can select elements by category or parameter name and value., ViewDuplicate - Duplicate views with given names., ViewPortsAlignment - This note relocate viewports positions for given sheets , according template sheet viewports positions including schedules., Wall.InteriorFaces - This node return interior wall faces of given rooms. ","engine_version":"1.3.2.2480","engine":"dynamo","engine_metadata":"","site_url":"https://twentytwopaths.wordpress.com/","repository_url":"https://github.com/mgjean/quasar","contains_binaries":false,"node_libraries":[]}